lixpaulian/efr32xx-rail/platform/middleware/usb_gecko/src/em_usbh.c
  ep->in = false;
  ep->toggle = USB_PID_DATA1;
  ep->remaining = length;

  hc = &hcs[ep->hcOut];
  hc->buf = ep->buf;
  hc->xferred = 0;
  hc->remaining = length;

  USBHHAL_HCStart(ep->hcOut);

  return USB_STATUS_OK;
}

USB_Status_TypeDef USBH_CtlSendSetup(USBH_Ep_TypeDef *ep)
{
  USBH_Hc_TypeDef *hc;

  hc = &hcs[ep->hcOut];
  hc->buf = (uint8_t*)&ep->setup;
  hc->xferred = 0;
  hc->remaining = USB_SETUP_PKT_SIZE;
  hc->ep = ep;
  hcs[ep->hcIn].ep = ep;

  ep->toggle = USB_PID_SETUP;
  ep->remaining = USB_SETUP_PKT_SIZE;

  ep->in = true;
  USBHHAL_HCInit(ep->hcIn);

  ep->in = false;
  USBHHAL_HCInit(ep->hcOut);

  USBHHAL_HCStart(ep->hcOut);

  return USB_STATUS_OK;
}

#if defined(USB_RAW_API)
int USBH_CtlTxRaw(uint8_t pid, USBH_Ep_TypeDef *ep, void *data, int byteCount)
{
  uint16_t  packets;
  int       hcnum, retval;
  uint32_t  hcchar, status;
  CORE_DECLARE_IRQ_STATE;

  hcnum = ep->hcOut;
  if ( byteCount > 0 ) {
    packets = (byteCount + ep->packetSize - 1) / ep->packetSize;
  } else {
    packets = 1;
  }

  CORE_ENTER_ATOMIC();

  USB->HC[hcnum].INTMSK = USB_HC_INT_STALL | USB_HC_INT_NAK | USB_HC_INT_ACK;
  USB->HC[hcnum].INT = 0xFFFFFFFF;        /* Clear all interrupt flags      */
  NVIC_ClearPendingIRQ(USB_IRQn);
  USB->HAINTMSK |= 1 << hcnum;            /* Enable host channel interrupt  */
  USB->HC[hcnum].CHAR =                   /* Program HCCHAR register        */
                        (ep->parentDevice->addr     <<   _USB_HC_CHAR_DEVADDR_SHIFT)
                        | ( (ep->addr & USB_EPNUM_MASK) << _USB_HC_CHAR_EPNUM_SHIFT)
                        | (ep->type                   <<   _USB_HC_CHAR_EPTYPE_SHIFT)
                        | (ep->packetSize             <<   _USB_HC_CHAR_MPS_SHIFT)
                        | (ep->parentDevice->speed
                           == (HPRT_L_SPEED >> _USB_HPRT_PRTSPD_SHIFT)
                           ? USB_HC_CHAR_LSPDDEV : 0);
  USB->HC[hcnum].TSIZ =
    ((byteCount << _USB_HC_TSIZ_XFERSIZE_SHIFT) & _USB_HC_TSIZ_XFERSIZE_MASK)
    | ((packets << _USB_HC_TSIZ_PKTCNT_SHIFT) & _USB_HC_TSIZ_PKTCNT_MASK)
    | ((pid << _USB_HC_TSIZ_PID_SHIFT) & _USB_HC_TSIZ_PID_MASK);
  USB->HC[hcnum].DMAADDR = (uint32_t)data;
  hcchar = (USB->HC[hcnum].CHAR & ~USB_HC_CHAR_CHDIS) | USB_HC_CHAR_CHENA;
  USB->HC[hcnum].CHAR = hcchar;

  /* Start polling for interrupt */
  retval = USB_STATUS_EP_ERROR;
  while ( (USBHAL_GetCoreInts() & USB_GINTSTS_HCHINT) == 0 ) {
  }
  if ( USBHHAL_GetHostChannelInts() & (1 << hcnum) ) {
    status = USBHHAL_GetHcInts(hcnum);
    hcchar |= USB_HC_CHAR_CHDIS;
    USB->HC[hcnum].CHAR = hcchar;
    USB->HC[hcnum].INTMSK = 0;
    USB->HC[hcnum].INT = 0xFFFFFFFF;

    if ( status & USB_HC_INT_STALL ) {
      retval = USB_STATUS_EP_STALLED;
    } else if ( status & USB_HC_INT_NAK ) {
      retval = USB_STATUS_EP_NAK;
    } else if ( status & USB_HC_INT_ACK ) {
      retval = USB_STATUS_OK;
    }
  }

  NVIC_ClearPendingIRQ(USB_IRQn);
  CORE_EXIT_ATOMIC();
  return retval;
}
#endif

/** @endcond */

/***************************************************************************//**
 * @brief
 *   Check if a device is connected.
 *
 * @return
 *   True if device connected, false otherwise.
 ******************************************************************************/
bool USBH_DeviceConnected(void)
{
  return USBH_portStatus == H_PORT_CONNECTED;
}

/***************************************************************************//**
 * @brief
 *   Read a configuration descriptor from a device.
 *
 * @note
 *   The transfer buffer length must be a multiple of 4 bytes in length and
 *   WORD (4 byte) aligned. When allocating the buffer, round buffer length up.
 *   If it is possible that the host will send more data than your device
 *   expects, round buffer size up to the next multiple of maxpacket size.
 *   @n This function is blocking and will not return before the transfer
 *   has completed, timed out (1 second) or failed.
 *
 * @param[in] device
 *   Pointer to a @ref USBH_Device_TypeDef data structure.
 *
 * @param[in] buf
 *   Pointer to transfer data buffer.
 *
 * @param[in] len
 *   The number of bytes to request, must not exceed transfer data buffer size.
 *
 * @param[in] configIndex
 *   Configuration index, a zero based number indicating which configuration
 *   to request.
 *
 * @return
 *   A positive (or zero) value indicates number of bytes transferred.
 *   @n A negative value indicates a transfer error code enumerated in
 *   @ref USB_Status_TypeDef.
 ******************************************************************************/
int USBH_GetConfigurationDescriptorB(USBH_Device_TypeDef *device,
                                     void *buf, int len,
                                     uint8_t configIndex)
{
  if ( device == NULL ) {
    DEBUG_USB_API_PUTS("\nUSBH_GetConfigurationDescriptorB(),"
                       " device NULL pointer");
    EFM_ASSERT(false);
    return USB_STATUS_ILLEGAL;
  }

  if ( buf == NULL ) {
    DEBUG_USB_API_PUTS("\nUSBH_GetConfigurationDescriptorB(),"
                       " buf NULL pointer");
    EFM_ASSERT(false);
    return USB_STATUS_ILLEGAL;
  }

  return USBH_ControlMsgB(&device->ep0,
                          USB_SETUP_DIR_D2H | USB_SETUP_RECIPIENT_DEVICE
                          | USB_SETUP_TYPE_STANDARD_MASK, /* bmRequestType */
                          GET_DESCRIPTOR,                 /* bRequest      */
                          (USB_CONFIG_DESCRIPTOR << 8) | configIndex,/* wValue */
                          0,                              /* wIndex        */
                          len,                            /* wLength       */
                          buf,                            /* void* data    */
                          DEFAULT_CTRL_TIMEOUT);          /* int timeout   */
}

/***************************************************************************//**
 * @brief
 *   Read a device descriptor from a device.
 *
 * @note
 *   The transfer buffer length must be a multiple of 4 bytes in length and
 *   WORD (4 byte) aligned. When allocating the buffer, round buffer length up.
 *   If it is possible that the host will send more data than your device
 *   expects, round buffer size up to the next multiple of maxpacket size.
 *   @n This function is blocking and will not return before the transfer
 *   has completed, timed out (1 second) or failed.
 *
 * @param[in] device
 *   Pointer to a @ref USBH_Device_TypeDef data structure.
 *
 * @param[in] buf
 *   Pointer to transfer data buffer.
 *
 * @param[in] len
 *   The number of bytes to request, must not exceed transfer data buffer size.
 *
 * @return
 *   A positive (or zero) value indicates number of bytes transferred.
 *   @n A negative value indicates a transfer error code enumerated in
 *   @ref USB_Status_TypeDef.
 ******************************************************************************/
int USBH_GetDeviceDescriptorB(USBH_Device_TypeDef *device,
                              void *buf, int len)
{
  if ( device == NULL ) {
    DEBUG_USB_API_PUTS("\nUSBH_GetDeviceDescriptorB(),"
                       " device NULL pointer");
    EFM_ASSERT(false);
    return USB_STATUS_ILLEGAL;
  }

