lixpaulian/efr32xx-rail/platform/middleware/usb_gecko/src/em_usbh.c
  if ( buf == NULL ) {
    DEBUG_USB_API_PUTS("\nUSBH_GetDeviceDescriptorB(),"
                       " buf NULL pointer");
    EFM_ASSERT(false);
    return USB_STATUS_ILLEGAL;
  }

  return USBH_ControlMsgB(&device->ep0,
                          USB_SETUP_DIR_D2H | USB_SETUP_RECIPIENT_DEVICE
                          | USB_SETUP_TYPE_STANDARD_MASK, /* bmRequestType */
                          GET_DESCRIPTOR,                 /* bRequest      */
                          USB_DEVICE_DESCRIPTOR << 8,     /* wValue        */
                          0,                              /* wIndex        */
                          len,                            /* wLength       */
                          buf,                            /* void* data    */
                          DEFAULT_CTRL_TIMEOUT);          /* int timeout   */
}

/***************************************************************************//**
 * @brief
 *   Get the bus speed of the device attached to the USB port.
 *
 * @return
 *   @ref PORT_FULL_SPEED or @ref PORT_LOW_SPEED.
 ******************************************************************************/
uint8_t USBH_GetPortSpeed(void)
{
  return USBHHAL_GetPortSpeed();
}

/***************************************************************************//**
 * @brief
 *   Read a string descriptor from a device.
 *
 * @note
 *   The transfer buffer length must be a multiple of 4 bytes in length and
 *   WORD (4 byte) aligned. When allocating the buffer, round buffer length up.
 *   If it is possible that the host will send more data than your device
 *   expects, round buffer size up to the next multiple of maxpacket size.
 *   @n This function is blocking and will not return before the transfer
 *   has completed, timed out (1 second) or failed.
 *   @n The maximum permitted USB string lenght is 255 bytes.
 *
 * @param[in] device
 *   Pointer to a @ref USBH_Device_TypeDef data structure.
 *
 * @param[in] buf
 *   Pointer to transfer data buffer.
 *
 * @param[in] bufLen
 *   Transfer data buffer size.
 *
 * @param[in] stringIndex
 *   String index, a zero based number indicating which string to request.
 *
 * @param[in] langID
 *   String language ID.
 *
 * @return
 *   A positive (or zero) value indicates number of bytes transferred.
 *   @n A negative value indicates a transfer error code enumerated in
 *   @ref USB_Status_TypeDef.
 ******************************************************************************/
int USBH_GetStringB(USBH_Device_TypeDef *device, uint8_t *buf, int bufLen,
                    uint8_t stringIndex, uint16_t langID)
{
  int retVal;
  USB_StringDescriptor_TypeDef* sd;

  if ( device == NULL ) {
    DEBUG_USB_API_PUTS("\nUSBH_GetStringB(), device NULL pointer");
    EFM_ASSERT(false);
    return USB_STATUS_ILLEGAL;
  }

  if ( buf == NULL ) {
    DEBUG_USB_API_PUTS("\nUSBH_GetStringB(), buf NULL pointer");
    EFM_ASSERT(false);
    return USB_STATUS_ILLEGAL;
  }

  retVal = USBH_ControlMsgB(
    &device->ep0,
    USB_SETUP_DIR_D2H | USB_SETUP_RECIPIENT_DEVICE
    | USB_SETUP_TYPE_STANDARD_MASK,                       /* bmRequestType */
    GET_DESCRIPTOR,                                       /* bRequest      */
    (USB_STRING_DESCRIPTOR << 8) | stringIndex,           /* wValue        */
    langID,                                               /* wIndex        */
    SL_MIN(bufLen, 255),                                  /* wLength       */
    buf,                                                  /* void* data    */
    DEFAULT_CTRL_TIMEOUT);                                /* int timeout   */

  if ( retVal > 2 ) {
    sd = (USB_StringDescriptor_TypeDef*)buf;
    if ( sd->len ) {
      sd->name[(sd->len - 2) / sizeof(char16_t)] = '\0';
    }
  }
  return retVal;
}

/***************************************************************************//**
 * @brief
 *   Initialize host protocol stack data structures.
 *
 * @details
 *   Host stack internal data structures are initialized, no actions will be
 *   performed on the USB port. Use this function once before starting USB
 *   host operation. USB operation is initated with
 *   @ref USBH_WaitForDeviceConnectionB().
 *
 * @param[in] p
 *   Pointer to initialization structure. See @ref USBH_Init_TypeDef.
 *
 * @return
 *   @ref USB_STATUS_OK on success, else an appropriate error code enumerated
 *   in @ref USB_Status_TypeDef.
 ******************************************************************************/
int USBH_Init(const USBH_Init_TypeDef *p)
{
  if ( p == NULL ) {
    DEBUG_USB_API_PUTS("\nUSBH_Init(), init struct NULL pointer");
    EFM_ASSERT(false);
    return USB_STATUS_ILLEGAL;
  }

  if ( (p->rxFifoSize      < MIN_EP_FIFO_SIZE_INBYTES)
       || (p->nptxFifoSize < MIN_EP_FIFO_SIZE_INBYTES)
       || (p->ptxFifoSize  < MIN_EP_FIFO_SIZE_INBYTES)
       || ( (p->rxFifoSize + p->nptxFifoSize + p->ptxFifoSize)
            > (MAX_HOST_FIFO_SIZE_INWORDS * 4) ) ) {
    DEBUG_USB_API_PUTS("\nUSBH_Init(), Illegal Tx/Rx FIFO memory configuration");
    EFM_ASSERT(false);
    return USB_STATUS_ILLEGAL;
  }
  USBH_initData = *p;

  CMU_ClockSelectSet(cmuClock_HF, cmuSelect_HFXO);
  USBTIMER_Init();
  USBH_portStatus = H_PORT_DISCONNECTED;

  /* Enable USB clock. */
  CORE_ATOMIC_SECTION(
    CMU->CMD = CMU_CMD_USBCCLKSEL_HFCLKNODIV;
    CMU->HFCORECLKEN0 |= CMU_HFCORECLKEN0_USB | CMU_HFCORECLKEN0_USBC;
    )

  /* Enable USB interrupt. */
  NVIC_ClearPendingIRQ(USB_IRQn);
  NVIC_EnableIRQ(USB_IRQn);

  return USB_STATUS_OK;
}

/***************************************************************************//**
 * @brief
 *   Populate device and endpoint data structures with data retrieved during
 *   device enumeration.
 *
 * @details
 *   Use this function prior to moving a device out of default state.
 *   The application itself must allocate device and endpoint structures.
 *   Data from a prior call to @ref USBH_QueryDeviceB() must be passed in input
 *   parameter @em buf. The device speed can be determined with
 *   @ref USBH_GetPortSpeed() for devices directly attached to the USB port.
 *   Devices attached via a hub must retrieve this information by querying the
 *   hub.
 *
 * @param[in] device
 *   Pointer to a @ref USBH_Device_TypeDef data structure.
 *
 * @param[in] buf
 *   A data buffer containing enumeration data retrieved with
 *   @ref USBH_QueryDeviceB().
 *
 * @param[in] ep
 *   Pointer to an array of @ref USBH_Ep_TypeDef endpoint data structures.
 *
 * @param[in] numEp
 *   Number of elements in endpoint array.
 *
 * @param[in] deviceSpeed
 *   @ref PORT_FULL_SPEED or @ref PORT_LOW_SPEED.
 *
 * @return
 *   @ref USB_STATUS_OK on success, else an appropriate error code enumerated
 *   in @ref USB_Status_TypeDef.
 ******************************************************************************/
int USBH_InitDeviceData(USBH_Device_TypeDef *device,
                        const uint8_t *buf,
                        USBH_Ep_TypeDef *ep,
                        int numEp,
                        uint8_t deviceSpeed)
{
  int i;

  if ( device == NULL ) {
    DEBUG_USB_API_PUTS("\nUSBH_InitDeviceData(), device NULL pointer");
    EFM_ASSERT(false);
    return USB_STATUS_ILLEGAL;
  }

  memset(device, 0, sizeof(USBH_Device_TypeDef) );

