lixpaulian/efr32xx-rail/platform/middleware/usb_gecko/src/em_usbh.c
  return USB_STATUS_OK;
}

/***************************************************************************//**
 * @brief
 *   Pretty print an endpoint descriptor on the debug serial port.
 *
 * @note
 *   This function is enabled when \#define USB_USE_PRINTF and
 *   \#define USER_PUTCHAR macros are properly defined when configuring the
 *   protocol stack in "usbconfig.h".
 *   The function is primarily meant for debugging purposes.
 *
 * @param[in] endpoint
 *   Pointer to a @ref USB_EndpointDescriptor_TypeDef data structure.
 *
 * @return
 *   @ref USB_STATUS_OK on success, else an appropriate error code enumerated
 *   in @ref USB_Status_TypeDef.
 ******************************************************************************/
int USBH_PrintEndpointDescriptor(
  const USB_EndpointDescriptor_TypeDef *endpoint)
{
  if ( endpoint == NULL ) {
    DEBUG_USB_API_PUTS("\nUSBH_PrintEndpointDescriptor(),"
                       " endpoint NULL pointer");
    EFM_ASSERT(false);
    return USB_STATUS_ILLEGAL;
  }

  USB_PRINTF("\n\nEndpoint descriptor:");
  USB_PRINTF("\n bLength              %d", endpoint->bLength);
  USB_PRINTF("\n bDescriptorType      0x%02X", endpoint->bDescriptorType);
  USB_PRINTF("\n bEndpointAddress     0x%02X", endpoint->bEndpointAddress);
  USB_PRINTF("\n bmAttributes         0x%02X", endpoint->bmAttributes);
  USB_PRINTF("\n wMaxPacketSize       %d", endpoint->wMaxPacketSize);
  USB_PRINTF("\n bInterval            %d\n", endpoint->bInterval);

  return USB_STATUS_OK;
}

/***************************************************************************//**
 * @brief
 *   Pretty print an interface descriptor on the debug serial port.
 *
 * @note
 *   This function is enabled when \#define USB_USE_PRINTF and
 *   \#define USER_PUTCHAR macros are properly defined when configuring the
 *   protocol stack in "usbconfig.h".
 *   The function is primarily meant for debugging purposes.
 *
 * @param[in] interface
 *   Pointer to a @ref USB_InterfaceDescriptor_TypeDef data structure.
 *
 * @return
 *   @ref USB_STATUS_OK on success, else an appropriate error code enumerated
 *   in @ref USB_Status_TypeDef.
 ******************************************************************************/
int USBH_PrintInterfaceDescriptor(
  const USB_InterfaceDescriptor_TypeDef *interface)
{
  if ( interface == NULL ) {
    DEBUG_USB_API_PUTS("\nUSBH_PrintInterfaceDescriptor(),"
                       " interface NULL pointer");
    EFM_ASSERT(false);
    return USB_STATUS_ILLEGAL;
  }

  USB_PRINTF("\n\nInterface descriptor:");
  USB_PRINTF("\n bLength              %d", interface->bLength);
  USB_PRINTF("\n bDescriptorType      0x%02X", interface->bDescriptorType);
  USB_PRINTF("\n bInterfaceNumber     %d", interface->bInterfaceNumber);
  USB_PRINTF("\n bAlternateSetting    %d", interface->bAlternateSetting);
  USB_PRINTF("\n bNumEndpoints        %d", interface->bNumEndpoints);
  USB_PRINTF("\n bInterfaceClass      0x%02X", interface->bInterfaceClass);
  USB_PRINTF("\n bInterfaceSubClass   0x%02X", interface->bInterfaceSubClass);
  USB_PRINTF("\n bInterfaceProtocol   0x%02X", interface->bInterfaceProtocol);
  USB_PRINTF("\n iInterface           %d\n", interface->iInterface);

  return USB_STATUS_OK;
}
#endif /* defined( USB_USE_PRINTF ) */

#if defined(__ICCARM__)
#pragma diag_suppress=Pa039
#endif
/***************************************************************************//**
 * @brief
 *   Print a USB string descriptor on the debug serial port.
 *
 * @note
 *   This function is enabled when the \#define USER_PUTCHAR macro is properly
 *   defined when configuring the protocol stack in "usbconfig.h".
 *   The function is primarily meant for debugging purposes.
 *
 * @param[in] pre
 *   Optional text string to prepend to the string descriptor. Pass NULL if
 *   not needed.
 *
 * @param[in] s
 *   Pointer to a @ref USB_StringDescriptor_TypeDef data structure.
 *
 * @param[in] post
 *   Optional text string to append to the string descriptor. Pass NULL if
 *   not needed.
 ******************************************************************************/
void USBH_PrintString(const char *pre,
                      const USB_StringDescriptor_TypeDef *s,
                      const char *post)
{
  char *c;

  if ( pre ) {
    USB_PUTS(pre);
  }

  if ( s ) {
    c = (char*)&s->name;
    while ( *c ) {
      USB_PUTCHAR(*c);
      c += 2;
    }
  }

  if ( post ) {
    USB_PUTS(post);
  }
}
#if defined(__ICCARM__)
#pragma diag_default=Pa039
#endif

/*
 * A request for a configuration descriptor returns the configuration
 * descriptor, all interface descriptors, and endpoint descriptors for all
 * of the interfaces in a single request.
 * The first interface descriptor follows the configuration descriptor.
 * The endpoint descriptors for the first interface follow the first interface
 * descriptor.
 * If there are additional interfaces, their interface descriptor and endpoint
 * descriptors follow the first interface's endpoint descriptors.
 * Class-specific and/or vendor-specific descriptors follow the standard
 * descriptors they extend or modify.
 */

/***************************************************************************//**
 * @brief
 *   Return a pointer to a configuration descriptor.
 *
 * @note
 *   This function search through @em buf looking for a given configuration
 *   descriptor.
 *
 * @param[in] buf
 *   A data buffer containing enumeration data retrieved with
 *   @ref USBH_QueryDeviceB().
 *
 * @param[in] configIndex
 *   Configuration index, a zero based number indicating which configuration
 *   descriptor to find.
 *
 * @return
 *   A pointer to @ref USB_ConfigurationDescriptor_TypeDef. NULL if no
 *   descriptor found.
 ******************************************************************************/
USB_ConfigurationDescriptor_TypeDef *USBH_QGetConfigurationDescriptor(
  const uint8_t *buf, int configIndex)
{
  int i;
  const uint8_t *start, *end;
  USB_DeviceDescriptor_TypeDef *dev;

  dev = USBH_QGetDeviceDescriptor(buf);
  if ( dev ) {
    if ( configIndex < dev->bNumConfigurations ) {
      /* Start of first configuration descriptor */
      start = buf + sizeof(USBH_Device_TypeDef);

