lixpaulian/efr32xx-rail/platform/middleware/usb_gecko/src/em_usbh.c
  /* Get configuration descriptor. */
  if ( USB_CONFIG_DESCSIZE != USBH_GetConfigurationDescriptorB(
         device,
         buf + sizeof(USBH_Device_TypeDef),
         SL_MIN( (size_t)USB_CONFIG_DESCSIZE,
                 bufsize - (size_t)USB_DEVICE_DESCSIZE),
         0) ) {
    return USB_STATUS_REQ_ERR;
  }
  memcpy(&device->confDesc,
         buf + sizeof(USBH_Device_TypeDef), USB_CONFIG_DESCSIZE);

  /* Get complete configuration descriptor. NOTE: Descriptor data is    */
  /* appended at the end of the device data structure !                 */
  if ( (USB_CONFIG_DESCSIZE + USB_INTERFACE_DESCSIZE)
       > USBH_GetConfigurationDescriptorB(device,
                                          buf + sizeof(USBH_Device_TypeDef),
                                          SL_MIN(device->confDesc.wTotalLength,
                                                 bufsize - sizeof(USBH_Device_TypeDef)),
                                          0) ) {
    return USB_STATUS_REQ_ERR;
  }

  return USB_STATUS_OK;
}

/***************************************************************************//**
 * @brief
 *   Read data from device endpoint, non-blocking version.
 *
 * @note
 *   The transfer buffer length must be a multiple of 4 bytes in length and
 *   WORD (4 byte) aligned. When allocating the buffer, round buffer length up.
 *   If it is possible that the host will send more data than your device
 *   expects, round buffer size up to the next multiple of maxpacket size.
 *   @n This function is non-blocking and returns immediately.
 *
 * @param[in] ep
 *   Pointer to a @ref USBH_Ep_TypeDef data structure.
 *
 * @param[in] data
 *   Pointer to transfer data buffer.
 *
 * @param[in] byteCount
 *   Number of bytes to transfer (zero is a valid value).
 *
 * @param[in] timeout
 *   Transfer timeout in milliseconds. The transfer will be terminated if not
 *   completed within @em timeout milliseconds. A value of 0 means
 *   infinite.
 *
 * @param[in] callback
 *   Function to be called on transfer completion. Supply NULL if no callback
 *   is needed. See @ref USB_XferCompleteCb_TypeDef.
 *
 * @return
 *   @ref USB_STATUS_OK on success, else an appropriate error code enumerated
 *   in @ref USB_Status_TypeDef.
 ******************************************************************************/
int USBH_Read(USBH_Ep_TypeDef *ep, void *data, int byteCount, int timeout,
              USB_XferCompleteCb_TypeDef callback)
{
  USBH_Hc_TypeDef *hc = &hcs[ep->hcIn];
  CORE_DECLARE_IRQ_STATE;

  if ( ep == NULL ) {
    DEBUG_USB_API_PUTS("\nUSBH_Read(), ep NULL pointer");
    EFM_ASSERT(false);
    return USB_STATUS_ILLEGAL;
  }

  if ( !USBH_DeviceConnected() ) {
    DEBUG_USB_API_PUTS("\nUSBH_Read(), No device connected");
    return USB_STATUS_ILLEGAL;
  }

  if ( (byteCount > MAX_XFER_LEN)
       || ( (byteCount / ep->packetSize) > MAX_PACKETS_PR_XFER)) {
    DEBUG_USB_API_PUTS("\nUSBH_Read(), Illegal transfer size");
    EFM_ASSERT(false);
    return USB_STATUS_ILLEGAL;
  }

  if ( (uint32_t)data & 3 ) {
    DEBUG_USB_API_PUTS("\nUSBH_Read(), Misaligned data buffer");
    EFM_ASSERT(false);
    return USB_STATUS_ILLEGAL;
  }

  CORE_ENTER_ATOMIC();
  if ( ep->state != H_EP_IDLE ) {
    CORE_EXIT_ATOMIC();
    DEBUG_USB_API_PUTS("\nUSBH_Read(), Endpoint is busy");
    return USB_STATUS_EP_BUSY;
  }

  if ( !ep->in ) {
    CORE_EXIT_ATOMIC();
    DEBUG_USB_API_PUTS("\nUSBH_Read(), Illegal EP direction");
    EFM_ASSERT(false);
    return USB_STATUS_ILLEGAL;
  }

  if ( !hc->idle ) {
    CORE_EXIT_ATOMIC();
    DEBUG_USB_API_PUTS("\nUSBH_Read(), Host channel is busy");
    return USB_STATUS_HC_BUSY;
  }

  ep->xferCompleted  = false;
  ep->state          = H_EP_DATA_IN;
  ep->xferCompleteCb = callback;
  ep->buf            = data;
  ep->remaining      = byteCount;
  ep->xferred        = 0;
  ep->timeout        = timeout;

  hc->buf = data;
  hc->xferred = 0;
  hc->remaining = byteCount;
  hc->ep = ep;

  if ( ep->type == USB_EPTYPE_INTR ) {
    if ( timeout ) {
      timeout = SL_MIN(timeout, ep->epDesc.bInterval);
    } else {
      timeout = ep->epDesc.bInterval;
    }
  }

  if ( timeout ) {
    USBTIMER_Start(ep->hcIn + HOSTCH_TIMER_INDEX,
                   timeout, hcTimeoutFunc[ep->hcIn]);
  }

  USBHHAL_HCInit(ep->hcIn);
  USBHHAL_HCStart(ep->hcIn);
  CORE_EXIT_ATOMIC();
  return USB_STATUS_OK;
}

/***************************************************************************//**
 * @brief
 *   Read data from device endpoint, blocking version.
 *
 * @note
 *   The transfer buffer length must be a multiple of 4 bytes in length and
 *   WORD (4 byte) aligned. When allocating the buffer, round buffer length up.
 *   If it is possible that the host will send more data than your device
 *   expects, round buffer size up to the next multiple of maxpacket size.
 *   @n This function is blocking and will not return before the transfer
 *   has completed, timed out or failed.
 *
 * @param[in] ep
 *   Pointer to a @ref USBH_Ep_TypeDef data structure.
 *
 * @param[in] data
 *   Pointer to transfer data buffer.
 *
 * @param[in] byteCount
 *   Number of bytes to transfer (zero is a valid value).
 *
 * @param[in] timeout
 *   Transfer timeout in milliseconds. The transfer will be terminated if not
 *   completed within @em timeout milliseconds. A value of 0 means
 *   infinite.
 *
 * @return
 *   A positive (or zero) value indicates number of bytes transferred.
 *   @n A negative value indicates a transfer error code enumerated in
 *   @ref USB_Status_TypeDef.
 ******************************************************************************/
int USBH_ReadB(USBH_Ep_TypeDef *ep, void *data, int byteCount, int timeout)
{
  int retVal;

  if ( CORE_IRQ_DISABLED() || CORE_IN_IRQ_CONTEXT() ) {
    DEBUG_USB_API_PUTS("\nUSBH_ReadB() called with int's disabled");
    EFM_ASSERT(false);
    return USB_STATUS_ILLEGAL;
  }

  retVal = USBH_Read(ep, data, byteCount, timeout, NULL);

  if ( retVal == USB_STATUS_OK ) {
    while ( !ep->xferCompleted ) ;

    if ( (retVal = ep->xferStatus) == USB_STATUS_OK ) {
      retVal = ep->xferred;
    }
  }

  return retVal;
}

/***************************************************************************//**
 * @brief
 *   Give a device an USB address.
 *
 * @note
 *   The device must currently have address 0. This command will move the
 *   device to the addressed state.
 *   @n This function is blocking and will not return before the transfer
 *   has completed, timed out (1 second) or failed.
 *
 * @param[in] device
 *   Pointer to a @ref USBH_Device_TypeDef data structure.
 *
 * @param[in] deviceAddress
 *   The new device address. Provide a value between 0 and 127.
 *
 * @return
 *   @ref USB_STATUS_OK on success, else an appropriate error code enumerated
 *   in @ref USB_Status_TypeDef.
 ******************************************************************************/
int USBH_SetAddressB(USBH_Device_TypeDef *device, uint8_t deviceAddress)
{
  int retVal;

  if ( device == NULL ) {
    DEBUG_USB_API_PUTS("\nUSBH_SetAddressB(), device NULL pointer");
    EFM_ASSERT(false);
    return USB_STATUS_ILLEGAL;
  }

  if ( deviceAddress > USB_MAX_DEVICE_ADDRESS ) {
    DEBUG_USB_API_PUTS("\nUSBH_SetAddressB(), Illegal device address");
    EFM_ASSERT(false);
    return USB_STATUS_ILLEGAL;
  }

